[
    {
    "title": "Dog",
    "preview": "The dog or domestic dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the wolf which is characterized by an upturning tail.",
    "link": "https://en.wikipedia.org/wiki/Dog" 
    },
    {
    "title": "Cat",
    "preview": "The cat (Felis catus) is a domestic species of a small carnivorous mammal. It is the only domesticated species in the family Felidae and is often referred to as the domestic cat.",
    "link": "https://en.wikipedia.org/wiki/Cat" 
    },
    {
    "title": "Cow",
    "preview": "Cattle, taurine cattle, Eurasian cattle, or European cattle (Bos taurus or Bos primigenius taurus) are large domesticated cloven-hooved herbivores.",
    "link": "https://en.wikipedia.org/wiki/Cow" 
    },
    {
    "title": "Fox",
    "preview": "Foxes are small to medium-sized, omnivorous mammals belonging to several genera of the family Canidae.",
    "link": "https://en.wikipedia.org/wiki/Fox" 
    },
    {
    "title": "Sheep",
    "preview": "Domestic sheep (Ovis aries) are quadrupedal, ruminant mammals typically kept as livestock. Although the name sheep applies to many species in the genus Ovis.",
    "link": "https://en.wikipedia.org/wiki/Sheep" 
    },
    {
    "title": "Pig",
    "preview": "The pig (Sus domesticus), often called swine, hog, or domestic pig when distinguishing from other members of the genus Sus, is an omnivorous, domesticated even-toed hoofed mammal.",
    "link": "https://en.wikipedia.org/wiki/Pig" 
    },
    {
    "title": "Spider",
    "preview": "Spiders (order Araneae) are air-breathing arthropods that have eight legs, chelicerae with fangs generally able to inject venom, and spinnerets that extrude silk.",
    "link": "https://en.wikipedia.org/wiki/Spider" 
    },
    {
    "title": "Frog",
    "preview": "A frog is any member of a diverse and largely carnivorous group of short-bodied, tailless amphibians composing the order Anura (literally without tail in Ancient Greek).",
    "link": "https://en.wikipedia.org/wiki/Frog" 
    },
    {
    "title": "Fish",
    "preview": "Fish are aquatic, craniate, gill-bearing animals that lack limbs with digits. Included in this definition are the living hagfish, lampreys, and cartilaginous and bony fish as well as various extinct related groups",
    "link": "https://en.wikipedia.org/wiki/Fish" 
    }
 
]
